from ABH import *
@ABH.on(events.NewMessage(pattern=r"^تجربة التنسيق$"))
async def test_direction(event):
    # قائمة تحتوي على كلمات عربية وانجليزية وآيديات
    test_list = ["سيف", "Gemini", "12345", "بوت الحماية", "Python_Code"]
    msg = '''
💰 أغنى الأشخاص في البوت 💰

1.ابـ،ـن،هـ.ـاشـ.ـم ✘→1,164,648,120
2.ليلى→99,210,205
3.زَيد→67,250,000
4.Pr. Shahad→51,793,121
5.ابو علي الشتبوستر→34,531,257
6.amanda→16,333,388
7.𝚃𝙷𝙴𝚀𝚄𝙸𝙴𝚃𝙴𝚅𝙰𝙽→15,697,857
8.بدون اسم→11,700,000
9.رسول→8,000,000
10.ياسر→3,546,212
'''
    await event.reply(f'\u200f {msg}')
