from telethon import TelegramClient, events
import random, os
SESSION = 'session'
API_ID = int(os.getenv("API_ID"))
API_HASH = os.getenv("API_HASH")
BOT_TOKEN = os.getenv("BOT_TOKEN")
bot = TelegramClient('bot', API_ID, API_HASH).start(bot_token=BOT_TOKEN)
CHANNEL = 'theholyqouran'
suras = {
    ('سورة الفاتحة',): '1',
    ('سورة البقرة',): '2',
    ('سورة آل عمران', 'سورة ال عمران'): '3',
    ('سورة النساء',): '4',
    ('سورة المايدة', 'سورة المائدة'): '5',
    ('سورة الأنعام', 'سورة الانعام'): '6',
    ('سورة الأعراف', 'سورة الاعراف'): '7',
    ('سورة الأنفال', 'سورة الانفال'): '8',
    ('سورة التوبة',): '9',
    ('سورة يونس',): '10',
    ('سورة هود',): '11',
    ('سورة يوسف',): '12',
    ('سورة الرعد',): '13',
    ('سورة ابراهيم', 'سورة إبراهيم'): '14',
    ('سورة الحجر',): '15',
    ('سورة النحل',): '16',
    ('سورة الاسراء', 'سورة الإسراء'): '17',
    ('سورة الكهف',): '18',
    ('سورة مريم',): '19',
    ('سورة طه',): '20',
    ('سورة الانبياء', 'سورة الأنبياء'): '21',
    ('سورة الحج',): '22',
    ('سورة المؤمنون', 'سورة المومنون'): '23',
    ('سورة النور',): '24',
    ('سورة الفرقان',): '25',
    ('سورة الشعراء',): '26',
    ('سورة النمل',): '27',
    ('سورة القصص',): '28',
    ('سورة العنكبوت',): '29',
    ('سورة الروم',): '30',
    ('سورة لقمان',): '31',
    ('سورة السجدة',): '32',
    ('سورة الأحزاب', 'سورة الاحزاب'): '33',
    ('سورة سبأ', 'سورة سبا'): '34',
    ('سورة فاطر',): '35',
    ('سورة يس',): '36',
    ('سورة الصافات',): '37',
    ('سورة ص',): '38',
    ('سورة الزمر',): '39',
    ('سورة غافر',): '40',
    ('سورة فصلت',): '41',
    ('سورة الشورى',): '42',
    ('سورة الزخرف',): '43',
    ('سورة الدخان',): '44',
    ('سورة الجاثية',): '45',
    ('سورة الاحقاف', 'سورة الأحقاف'): '46',
    ('سورة محمد',): '47',
    ('سورة الفتح',): '48',
    ('سورة الحجرات',): '49',
    ('سورة ق',): '50',
    ('سورة الذاريات',): '51',
    ('سورة الطور',): '52',
    ('سورة النجم',): '53',
    ('سورة القمر',): '54',
    ('سورة الرحمن',): '55',
    ('سورة الواقعة',): '56',
    ('سورة الحديد',): '57',
    ('سورة المجادلة',): '58',
    ('سورة الحشر',): '59',
    ('سورة الممتحنة',): '60',
    ('سورة الصف',): '61',
    ('سورة الجمعة',): '62',
    ('سورة المنافقون',): '63',
    ('سورة التغابن',): '64',
    ('سورة الطلاق',): '65',
    ('سورة التحريم',): '66',
    ('سورة الملك',): '67',
    ('سورة القلم',): '68',
    ('سورة الحاقة',): '69',
    ('سورة المعارج',): '70',
    ('سورة نوح',): '71',
    ('سورة الجن',): '72',
    ('سورة المزمل',): '73',
    ('سورة المدثر',): '74',
    ('سورة القيامة',): '75',
    ('سورة الإنسان', 'سورة الانسان'): '76',
    ('سورة المرسلات',): '77',
    ('سورة النبا', 'سورة النبأ'): '78',
    ('سورة النازعات',): '79',
    ('سورة عبس',): '80',
    ('سورة التكوير',): '81',
    ('سورة الانفطار', 'سورة الإنفطار'): '82',
    ('سورة المطففين',): '83',
    ('سورة الانشقاق',): '84',
    ('سورة البروج',): '85',
    ('سورة الطارق',): '86',
    ('سورة الاعلى', 'سورة الأعلى'): '87',
    ('سورة الغاشية',): '88',
    ('سورة الفجر',): '89',
    ('سورة البلد',): '90',
    ('سورة الشمس',): '91',
    ('سورة الليل',): '92',
    ('سورة الضحى',): '93',
    ('سورة الشرح',): '94',
    ('سورة التين',): '95',
    ('سورة العلق',): '96',
    ('سورة القدر',): '97',
    ('سورة البينة',): '98',
    ('سورة الزلزلة',): '99',
    ('سورة العاديات',): '100',
    ('سورة القارعة',): '101',
    ('سورة التكاثر',): '102',
    ('سورة العصر',): '103',
    ('سورة الهمزة',): '104',
    ('سورة الفيل',): '105',
    ('سورة قريش',): '106',
    ('سورة الماعون',): '107',
    ('سورة الكوثر',): '108',
    ('سورة الكافرون',): '109',
    ('سورة النصر',): '110',
    ('سورة المسد',): '111',
    ('سورة الاخلاص', 'سورة الإخلاص'): '112',
    ('سورة الفلق',): '113',
    ('سورة الناس',): '114',
}
all_suras = [(names[0], number) for names, number in suras.items()]
@bot.on(events.NewMessage)
async def handler(event):
    text = event.raw_text.strip()    
    if text.lower() in ['قرآن', 'قران']:
        num = random.randint(1, 114) + 1
        await bot.forward_messages(
            event.chat_id,
            messages=num,
            from_peer='theholyqouran',
            reply_to=event.id  # رد على الرسالة الأصلية
        )

        return
    for names, num in suras.items():
        if text in names:
            num_int = int(num)
            link_id = num_int + 1
            await bot.send_file(
                event.chat_id,
            f'https://t.me/{CHANNEL}/{num}'
            )
            return
    await event.reply("❌ لم يتم العثور على السورة.")
bot.run_until_disconnected()
