import os
from telethon import TelegramClient, events
api_id = os.getenv('API_ID')      
api_hash = os.getenv('API_HASH')  
bot_token = os.getenv('BOT_TOKEN')
ABH = TelegramClient('code', api_id, api_hash).start(bot_token=bot_token)
uinfo = {}
@ABH.on(events.NewMessage(pattern=r'^اوامري|اوامر$'))
async def start(event):
    await event.reply("""
    **اوامر بوت مخفي** 卐 \n
    1 --> `اوامر التوب` 
    امر بسيط يحسب عدد رسائل مجموعتك \n\n
    2 --> `اوامر التقييد`
    امر مكافح للفشار 90% ممنوع
    3 --> `اوامر الالعاب` 
    العاب جديدة ب فكره مميزة ولمسه ابداعية \n\n                  
    4 --> `اوامر الترجمة`
    يعمل بالرد او مع الامر لكن انتبه تعمله بالرد ومع الامر😉\n\n
    5 --> `اوامر الايدي`
    **امر مميز** ان تتواصل للشخص عن طريق ايدي حسابة\n\n
    6 --> `اوامر الكشف`             
    **امر مميز** يأخذ screenshot للرابط ``الروابط الملغمة هنا تظهر``` \n\n
    7 --> `اوامر الحسبان`
    امر  يحسب ل اشهر الصيام والعزاء و يحسب ل يوم من اختيارك\n\n
    8 --> `اوامر الميمز`
    اوامر مخصصة للميمز بصورة مختلفة\n\n
    9 --> `اوامر الهمسة`
    امر هزلي و سري يعمل همسة كالمعتاد باليوزر او بالايدي\n\n
    10 --> `اوامر البحث`
    يعمل بحث في موقع ويكيبيديا\n\n
    11 --> `اوامر الصوتيات`
    امر يرسل لك لطمية عشوائية\n\n
       """)
ABH.run_until_disconnected()
