import os
from telethon import TelegramClient, events
api_id = os.getenv('API_ID')      
api_hash = os.getenv('API_HASH')  
bot_token = os.getenv('BOT_TOKEN')
ABH = TelegramClient('code', api_id, api_hash).start(bot_token=bot_token)
uinfo = {}
@ABH.on(events.NewMessage(pattern=r'^اوامري|اوامر$'))
async def start(event):
await event.reply("""
**أوامر البوت المخفي** 卐

1 → `اوامر التوب`  
   يحسب عدد رسائل مجموعتك.  

2 → `اوامر التقييد`  
   أمر مكافح للكلمات غير اللائقة بنسبة 90%.  

3 → `اوامر الالعاب`  
   ألعاب جديدة بفكرة مميزة ولمسة إبداعية.  

4 → `اوامر الترجمة`  
   يعمل بالرد أو مع الأمر، لكن لا تستخدمه معهما معًا.  

5 → `اوامر الايدي`  
   **أمر مميز** يمكنك من التواصل مع الشخص عبر معرف حسابه.  

6 → `اوامر الكشف`  
   **أمر مميز** يأخذ لقطة شاشة للرابط، وتظهر الروابط الملغمة هنا.  

7 → `اوامر الحسبان`  
   يحسب تواريخ أشهر الصيام والعزاء، أو أي يوم من اختيارك.  

8 → `اوامر الميمز`  
   أوامر مخصصة لإنشاء الميمز بطرق مختلفة.  

9 → `اوامر الهمسة`  
   أمر هزلي وسري لإنشاء همسة باستخدام اليوزر أو المعرف.  

10 → `اوامر البحث`  
   يقوم بالبحث في موقع ويكيبيديا.  

11 → `اوامر الصوتيات`  
   يرسل لك لطمية عشوائية.  
""")

ABH.run_until_disconnected()
