import os
from telethon import TelegramClient, events
api_id = os.getenv('API_ID')      
api_hash = os.getenv('API_HASH')  
bot_token = os.getenv('BOT_TOKEN')
ABH = TelegramClient('code', api_id, api_hash).start(bot_token=bot_token)
uinfo = {}
@ABH.on(events.NewMessage(pattern=r'^اوامري|اوامر$'))
async def start(event):
    await event.reply("""
    **اوامر بوت مخفي** 卐 
    1 --> `اوامر التوب` \n
    امر بسيط يحسب عدد رسائل مجموعتك
    2 --> `اوامر التقييد` \n 
    امر مكافح للفشار 90% ممنوع
    3 --> `اوامر الالعاب` \n
    العاب جديدة ب فكره مميزة ولمسه ابداعية                   
    4 --> `اوامر الترجمة`\n
    يعمل بالرد او مع الامر لكن انتبه تعمله بالرد ومع الامر😉
    5 --> `اوامر الايدي`
    **امر مميز** ان تتواصل للشخص عن طريق ايدي حسابة
    6 --> `اوامر الكشف`             
    **امر مميز** يأخذ screenshot للرابط ``الروابط الملغمة هنا تظهر```
    7 --> `اوامر الحسبان`
    امر  يحسب ل اشهر الصيام والعزاء و يحسب ل يوم من اختيارك
    8 --> `اوامر الميمز`
    اوامر مخصصة للميمز بصورة مختلفة
    9 --> `اوامر الهمسة`
    امر هزلي و سري يعمل همسة كالمعتاد باليوزر او بالايدي
    10 --> `اوامر البحث`
    يعمل بحث في موقع ويكيبيديا
    11 --> `اوامر الصوتيات`
    امر يرسل لك لطمية عشوائية
       """)
ABH.run_until_disconnected()
